package com.poran.bpl2017live;

import android.content.Context;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.LinearLayoutManager;

import com.google.android.gms.ads.AdView;

import java.util.ArrayList;
import java.util.Arrays;

public class Recyclerview extends AppCompatActivity {
    private android.support.v7.widget.RecyclerView recyclerView;
    private android.support.v7.widget.RecyclerView.Adapter mAdapter;
    private android.support.v7.widget.RecyclerView.LayoutManager mLayout;
    public ArrayList<String> day =new ArrayList<>();
    public ArrayList<String>time=new ArrayList<>();
    public ArrayList<String>date=new ArrayList<>();
    public ArrayList<String>vanue=new ArrayList<>();
    public ArrayList<String>teamList1=new ArrayList<>();
    public ArrayList<String>teamList2=new ArrayList<>();
    private Context context;
    private AdView adView;



    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_recycler_view);
        addList();
        context=this;
        adView=(AdView)findViewById(R.id.adView);


        recyclerView= (android.support.v7.widget.RecyclerView) findViewById(R.id.recyclerview);
        recyclerView.setHasFixedSize(true);


        AdsView adsView=new AdsView(this,adView);
        adsView.makeAdView();
        adsView.displayInterstitial();
        mLayout=new LinearLayoutManager(this);
        recyclerView.setLayoutManager(mLayout);
        mAdapter=new TimeShedeul(date,time,day,vanue,teamList1,teamList2);
        recyclerView.setAdapter(mAdapter);
    }

    private void addList(){
        String dateArr[]={"৪","৪","৫","৫","৭","৭","৮","৮",

                "১১","১১","১২","১২", "১৪","১৪","১৫","১৫","১৭","১৭","১৮","১৮","২০","২০","২১","২১",

                "২৪","২৪","২৫","২৫","২৭","২৭","২৮","২৮","২৯","২৯",

                "২","২","৩","৩","৫","৫","৬","৬","৮","৮","১০","১২"};
        date.addAll(Arrays.asList(dateArr));
        String dayArr[]={"শনিবার","শনিবার","রবিবার","রবিবার","মঙ্গলবার","মঙ্গলবার","বুধবার","বুধবার",

                "শনিবার","শনিবার", "রবিবার","রবিবার", "মঙ্গলবার","মঙ্গলবার","বুধবার","বুধবার", "শুক্রবার","শুক্রবার","শনিবার","শনিবার",
               "সোমবার","সোমবার","মঙ্গলবার","মঙ্গলবার",

                "শুক্রবার","শুক্রবার", "শনিবার","শনিবার", "সোমবার","সোমবার","মঙ্গলবার","মঙ্গলবার", "বুধবার","বুধবার",

                "শনিবার","শনিবার","রবিবার","রবিবার","মঙ্গলবার","মঙ্গলবার", "বুধবার","বুধবার", "শুক্রবার","শুক্রবার","রবিবার","মঙ্গলবার"};
        day.addAll(Arrays.asList(dayArr));
        String timeArr[]={"২","৭","২","৭","২","৭","২","৭",

                "২","৭","২","৭","২","৭","২","৭","২.৩০","৭.১৫", "২","৭", "২","৭","২","৭",

                "২.৩০","৭.১৫","২","৭","২","৭","২","৭","২","৭",

                "২","৭","২","৭", "২","৭","২","৭","২.৩০","৭.১৫","৭","৭"};

        time.addAll(Arrays.asList(timeArr));
        String vanuearr[]={" সিলেট বিভাগীয় স্টেডিয়াম,সিলেট"," সিলেট বিভাগীয় স্টেডিয়াম,সিলেট"," সিলেট বিভাগীয় স্টেডিয়াম,সিলেট"," সিলেট বিভাগীয় স্টেডিয়াম,সিলেট"," সিলেট বিভাগীয় স্টেডিয়াম,সিলেট",
                " সিলেট বিভাগীয় স্টেডিয়াম,সিলেট", " সিলেট বিভাগীয় স্টেডিয়াম,সিলেট"," সিলেট বিভাগীয় স্টেডিয়াম,সিলেট",

                "মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা", "মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা",
                "মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা", "মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা",
                "মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা", "মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা", "মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা",
                "মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা", "মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা", "মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা",

                "জহুর আহমেদ চৌধুরী স্টেডিয়াম,চট্রগ্রাম","জহুর আহমেদ চৌধুরী স্টেডিয়াম,চট্রগ্রাম","জহুর আহমেদ চৌধুরী স্টেডিয়াম,চট্রগ্রাম","জহুর আহমেদ চৌধুরী স্টেডিয়াম,চট্রগ্রাম",
                "জহুর আহমেদ চৌধুরী স্টেডিয়াম,চট্রগ্রাম","জহুর আহমেদ চৌধুরী স্টেডিয়াম,চট্রগ্রাম","জহুর আহমেদ চৌধুরী স্টেডিয়াম,চট্রগ্রাম","জহুর আহমেদ চৌধুরী স্টেডিয়াম,চট্রগ্রাম",
                "জহুর আহমেদ চৌধুরী স্টেডিয়াম,চট্রগ্রাম","জহুর আহমেদ চৌধুরী স্টেডিয়াম,চট্রগ্রাম",

                "মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা",
                "মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা",
                "মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা","মিরপুর শের-ই-বাংলা জাতীয় স্টেডিয়াম,ঢাকা",
               };

        vanue.addAll(Arrays.asList(vanuearr));
        String teamArr1[]={"ঢাকা ডাইনামাইটস "," রাজশাহী কিংস "," কুমিল্লা ভিক্টোরিয়ান্স ","ঢাকা ডাইনামাইটস","চট্রগ্রাম ভাইকিংস","সিলেট সুর্মা সিক্সারস ",
                " রংপুর রাইডার্স ","খুলনা টাইটান্স ",//syllhet

                " রংপুর রাইডার্স ","ঢাকা ডাইনামাইটস","চট্রগ্রাম ভাইকিংস","রাজশাহী কিংস","ঢাকা ডাইনামাইটস", "কুমিল্লা ভিক্টোরিয়ান্স","খুলনা টাইতান্স ", "চট্রগ্রাম ভাইকিংস",
                "রাজশাহী কিংস ","চট্রগ্রাম ভাইকিংস", "ঢাকা ডাইনামাইটস", "কুমিল্লা ভিক্টোরিয়ান্স ","ঢাকা ডাইনামাইটস","সিলেট সুর্মা সিক্সারস "," খুলনা টাইতান্স ","ঢাকা ডাইনামাইটস ",
                //dhaka
                "খুলনা টাইটান্স ","চট্রগ্রাম ভাইকিংস",  "কুমিল্লা ভিক্টোরিয়ান্স ","চট্রগ্রাম ভাইকিংস","চট্রগ্রাম ভাইকিংস","খুলনা টাইটান্স ",  "রংপুর রাইডার্স ", "কুমিল্লা ভিক্টোরিয়ান্স ",
                "চট্রগ্রাম ভাইকিংস","ঢাকা ডাইনামাইটস",
                //chittagong

            "রংপুর রাইডার্স",  "ঢাকা ডাইনামাইটস", "চট্রগ্রাম ভাইকিংস","খুলনা টাইটান্স","খুলনা টাইটান্স","চট্রগ্রাম ভাইকিংস ","ঢাকা ডাইনামাইটস","কুমিল্লা ভিক্টোরিয়ান্স",
                "ইলিমিনেটর(৩য় স্থান ","১ম কোয়ালিফায়ার (১ম স্থান ", "২য় কোয়ালিফায়ার(ইলিমিনেটর জয়ী দল ", "ফাইনাল (১ম কোয়ালিফায়ারের জয়ী দল "
             };
        teamList1.addAll(Arrays.asList(teamArr1));

        String teamArr2[]={"সিলেট সুর্মা সিক্সারস "," রংপুর রাইডার্স ","সিলেট সুর্মা সিক্সারস "," খুলনা টাইটান্স  ","কুমিল্লা ভিক্টোরিয়ান্স "," রাজশাহী কিংস ","চট্রগ্রাম ভাইকিংস ",
                "সিলেট সুর্মা সিক্সারস",//syllhet

                " রাজশাহী কিংস "," সিলেট সুর্মা সিক্সারস "," খুলনা টাইটান্স  ", "কুমিল্লা ভিক্টোরিয়ান্স "," খুলনা টাইটান্স  ","চট্রগ্রাম ভাইকিংস", " সিলেট সুর্মা সিক্সারস ", "ঢাকা ডাইনামাইটস",
                "সিলেট সুর্মা সিক্সারস ","খুলনা টাইটান্স"," রাজশাহী কিংস ", "রংপুর রাইডার্স", "কুমিল্লা ভিক্টোরিয়ান্স", " রংপুর রাইডার্স"," রাজশাহী কিংস ",  " রংপুর রাইডার্স ",
                    //dhaka
               " রংপুর রাইডার্স ", "সিলেট সুর্মা সিক্সারস ", "রাজশাহী কিংস", " রংপুর রাইডার্স ","ঢাকা ডাইনামাইটস", "রাজশাহী কিংস", "সিলেট সুর্মা সিক্সারস ","খুলনা  টাইটান্স",
                "রাজশাহী কিংস","কুমিল্লা ভিক্টোরিয়ান্স",
                //chittagong

                "কুমিল্লা ভিক্টোরিয়ান্স","রাজশাহী কিংস","সিলেট সুর্মা সিক্সারস ","রংপুর রাইডার্স", "কুমিল্লা ভিক্টোরিয়ান্স","রাজশাহী কিংস","রংপুর রাইডার্স","সিলেট সুর্মা সিক্সারস ",
                " ৪র্থ স্থান)"," ২য় স্থান )","১ম কোয়ালিফায়ারে পরাজিত দল)", " ২য় কোয়ালিফায়ারে জয়ী দল )"
               };

        teamList2.addAll(Arrays.asList(teamArr2));







    }



}

