package com.poran.bpl2017live;

import java.text.SimpleDateFormat;
import java.util.Date;


public class TodaysMatchAnim {


    static String dateString[]= {
            "04-11", "04-11", "05-11", "05-11", "07-11", "07-11", "08-11", "08-11", "11-11", "11-11",
            "12-11", "12-11", "14-11", "14-11", "15-11", "15-11", "17-11", "17-11", "18-11", "18-11",
            "20-11", "20-11", "21-11", "21-11", "24-11", "24-11", "25-11", "25-11", "27-11", "27-11",
            "28-11","28-11", "29-11", "29-11", "02-12", "02-12",
             "03-12", "03-12", "05-12",  "05-12", "06-12","06-12", "08-12",  "08-12",
            "10-12", "12-12"
    };
    static String team1[]={"ঢাকা ডাইনামাইটস "," রাজশাহী কিংস "," কুমিল্লা ভিক্টোরিয়ান্স ","ঢাকা ডাইনামাইটস","চট্রগ্রাম ভাইকিংস","সিলেট সুর্মা সিক্সারস ",
            " রংপুর রাইডার্স ","খুলনা টাইটান্স ",//syllhet

            " রংপুর রাইডার্স ","ঢাকা ডাইনামাইটস","চট্রগ্রাম ভাইকিংস","রাজশাহী কিংস","ঢাকা ডাইনামাইটস", "কুমিল্লা ভিক্টোরিয়ান্স","খুলনা টাইতান্স ", "চট্রগ্রাম ভাইকিংস",
            "রাজশাহী কিংস ","চট্রগ্রাম ভাইকিংস", "ঢাকা ডাইনামাইটস", "কুমিল্লা ভিক্টোরিয়ান্স ","ঢাকা ডাইনামাইটস","সিলেট সুর্মা সিক্সারস "," খুলনা টাইতান্স ","ঢাকা ডাইনামাইটস ",
            //dhaka
            "খুলনা টাইটান্স ","চট্রগ্রাম ভাইকিংস",  "কুমিল্লা ভিক্টোরিয়ান্স ","চট্রগ্রাম ভাইকিংস","চট্রগ্রাম ভাইকিংস","খুলনা টাইটান্স ",  "রংপুর রাইডার্স ", "কুমিল্লা ভিক্টোরিয়ান্স ",
            "চট্রগ্রাম ভাইকিংস","ঢাকা ডাইনামাইটস",
            //chittagong

            "রংপুর রাইডার্স",  "ঢাকা ডাইনামাইটস", "চট্রগ্রাম ভাইকিংস","খুলনা টাইটান্স","খুলনা টাইটান্স","চট্রগ্রাম ভাইকিংস ","ঢাকা ডাইনামাইটস","কুমিল্লা ভিক্টোরিয়ান্স",
            "ইলিমিনেটর(৩য় স্থান ","১ম কোয়ালিফায়ার (১ম স্থান ", "২য় কোয়ালিফায়ার(ইলিমিনেটর জয়ী দল ", "ফাইনাল (১ম কোয়ালিফায়ারের জয়ী দল "
    };
    static String team2[]={"সিলেট সুর্মা সিক্সারস "," রংপুর রাইডার্স ","সিলেট সুর্মা সিক্সারস "," খুলনা টাইটান্স  ","কুমিল্লা ভিক্টোরিয়ান্স "," রাজশাহী কিংস ","চট্রগ্রাম ভাইকিংস ",
            "সিলেট সুর্মা সিক্সারস",//syllhet

            " রাজশাহী কিংস "," সিলেট সুর্মা সিক্সারস "," খুলনা টাইটান্স  ", "কুমিল্লা ভিক্টোরিয়ান্স "," খুলনা টাইটান্স  ","চট্রগ্রাম ভাইকিংস", " সিলেট সুর্মা সিক্সারস ", "ঢাকা ডাইনামাইটস",
            "সিলেট সুর্মা সিক্সারস ","খুলনা টাইটান্স"," রাজশাহী কিংস ", "রংপুর রাইডার্স", "কুমিল্লা ভিক্টোরিয়ান্স", " রংপুর রাইডার্স"," রাজশাহী কিংস ",  " রংপুর রাইডার্স ",
            //dhaka
            " রংপুর রাইডার্স ", "সিলেট সুর্মা সিক্সারস ", "রাজশাহী কিংস", " রংপুর রাইডার্স ","ঢাকা ডাইনামাইটস", "রাজশাহী কিংস", "সিলেট সুর্মা সিক্সারস ","খুলনা  টাইটান্স",
            "রাজশাহী কিংস","কুমিল্লা ভিক্টোরিয়ান্স",
            //chittagong

            "কুমিল্লা ভিক্টোরিয়ান্স","রাজশাহী কিংস","সিলেট সুর্মা সিক্সারস ","রংপুর রাইডার্স", "কুমিল্লা ভিক্টোরিয়ান্স","রাজশাহী কিংস","রংপুর রাইডার্স","সিলেট সুর্মা সিক্সারস ",
            " ৪র্থ স্থান)"," ২য় স্থান )","১ম কোয়ালিফায়ারে পরাজিত দল)", " ২য় কোয়ালিফায়ারে জয়ী দল )"
    };



    int c=0;
    public String getDate(){
        Date date = new Date();  // to get the date
        SimpleDateFormat df = new SimpleDateFormat("dd-MM"); // getting date in this format
        String formattedDate = df.format(date.getTime());
        return formattedDate;
    }
}
